<!DOCTYPE html>
<html>
<head>
  <meta charset="utf-8">
  <title>Balfron Tower: a building archive</title>
  <link rel="stylesheet" media="all" href="/assets/application-9aded7de2084269196b9c3b9414ec529.css" />
  <script src="/assets/application-7970a5815be83cfa7cc1af68bce60324.js"></script>
  <meta name="csrf-param" content="authenticity_token" />
<meta name="csrf-token" content="QVsHqJ3pm2fBwoWsPTbhB5xGC2p7gTtEbClRGpLB2hXFv0PBLAgbCnTjuc/l4zxieK7KjMb5Q9Wti6ZQlzmvTQ==" />
  <meta name='description' content='Sharing access to help build a fuller understanding of the communities and spaces that make Balfron Tower a home'>
</head>
<body>

<div class='responsive'>
  <div class='logo'>
    <a href='/'><img src="/assets/logo-48aa2d9936be1a79610764dbd2f0022e.svg" alt="Logo" /></a>
  </div>
</div>

<div class='responsive'>
  <div class='document_details'>
    <a class="back" href="/">
      ← back to index
    </a><br>
      <div class='document_cover'>
        <img src="/uploads/document/cover/2/full_1967_Architecture_Aujourdhui.jpg" alt="Full 1967 architecture aujourdhui" />
      </div>
    <div class='basic_info'>
      <h2>
        &#39;Unité Résidentielle à Londres&#39; Architecture d&#39;Aujourd&#39;hui
        <div class='document_type_icons'>
            <span data-document-type='book'>
              <?xml version="1.0" encoding="utf-8"?>
<!-- Generator: Adobe Illustrator 18.1.1, SVG Export Plug-In . SVG Version: 6.00 Build 0)  -->
<svg version="1.1" id="Layer_1" xmlns="http://www.w3.org/2000/svg" x="0px" y="0px" viewbox="0 0 595.3 595.3" enable-background="new 0 0 595.3 595.3" xmlns:xlink="http://www.w3.org/1999/xlink" xml:space="preserve" class="document_type_icon">
<g>
	<path d="M298.5,188.5l-152.1-48l1.7,256.3l153.8,48l147.2-48V140.5L298.5,188.5z M281.9,386.9l-102.5-28.1V176.9l102.5,31.4V386.9z
		 M315,386.9V208.3l102.5-29.8v180.2L315,386.9z"></path>
	<path d="M367.9,249.6c-13.2,0-26.5,13.2-26.5,26.5c0,16.5,9.9,26.5,26.5,26.5c11.6,0,26.5-11.6,26.5-26.5
		C394.4,264.5,389.4,249.6,367.9,249.6z"></path>
	<rect x="196.2" y="308.3" transform="matrix(-0.9648 -0.2631 0.2631 -0.9648 376.9375 683.5919)" width="76.1" height="16.5"></rect>
	<rect x="196.7" y="250.5" transform="matrix(-0.9648 -0.2631 0.2631 -0.9648 393.1517 570.1794)" width="76.1" height="16.5"></rect>
	<rect x="196.7" y="219.1" transform="matrix(-0.9648 -0.2631 0.2631 -0.9648 401.4033 508.4812)" width="76.1" height="16.5"></rect>
</g>
</svg>

            </span>
          <span class='document_types_legend'>
            Book
          </span>
        </div>
      </h2>
      <span class='author_year'>Ernö Goldfinger, 1967</span>
    </div>

    <!-- Intro -->
      <div class='intro section'>
        <h2>Intro</h2>
        <div class='inner'>
          <p><em>Ern&ouml; Goldfinger was a foreign reporter for the review Architecture d&#39;Aujourd&#39;hui which was instrumental in promoting the ideals of modern architecture. In 1967, the year Balfron Tower was completed but not yet occupied, Goldfinger wrote an article on the tower which featured in their section &lsquo;Projets et R&eacute;alisations en Grande-Bretagne&rsquo;.&nbsp;</em></p>

<p><em>The text is accompanied by three images; an elevation before the cantileved boiler room was added to the top of the circulation tower; a masterplan; and plans of three levels of Balfron Tower.</em></p>

<p><em>Please find a transcription below alongside a translation in red. With great thanks to G!&nbsp;</em></p>

        </div>
      </div>

    <!-- Quotes -->
      <div class='quotes section'>
        <h2>Quotes</h2>
        <div class='inner'>
          <p>Le terrain sur lequel se d&eacute;veloppera cet ensemble d&#39;habitation demand&eacute; par le Greater London Council, est situ&eacute; &agrave; proximit&eacute; des rives de la Tamise en - tete de pont - de l&#39;important tunnel qu&#39;emprunte une des grandes voies de communication de la r&eacute;gion londonienne.</p>

<p><u>The land selected for this housing project&nbsp;&ndash;&nbsp;commissioned by the Greater London Council &ndash; is situated close to the banks of the river Thames and it will act as &lsquo;a bridgehead&rsquo; to the tunnel which serves one of the most important communication routes of the London area.</u></p>

<p>Les architectes ont adopt&eacute; le principe de la construction en hauteur pour l&rsquo;immeuble principal (27 &eacute;tages), afin de lib&eacute;rer une grande partie du sol et de n&#39;implanter qu&#39;un autre b&acirc;timent haut de douze &eacute;tages et trois b&acirc;timents bas &agrave; deux niveaux. Au rez-de-chauss&eacute;e de ces derniers sont group&eacute;s des logements pour personnes &acirc;g&eacute;es.</p>

<p><u>The architects have adopted the principle of high-rise construction for the main building (27 storeys) in order to free up a large part of the land area and to construct just one other twelve storey building and three low buildings on two levels &ndash; these will offer housing to senior citizens at the ground floor level.</u></p>

<p>Un soin particulier a &eacute;t&eacute; apport&eacute; a l&#39;&eacute;tude de la circulation, bas&eacute;e sur la s&eacute;paration totale entre automobiles et pi&eacute;tons. Les voies carrossables, en contre-bas, conduisent au garage souterrain de 79 places dont l&#39;am&eacute;nagement est facilit&eacute; par la pente naturelle du sol (d&eacute;nivellation: 3 m). Ce garage est couvert en toit-jardin, apportant ainsi un espace suppl&eacute;mentaire pour la d&eacute;tente et les jeux d&#39;enfants. Le r&eacute;seau de cheminement pour les pi&eacute;tons se d&eacute;veloppe au sol et &agrave; des niveaux parfois surbaiss&eacute;s, parfois sur&eacute;lev&eacute;s. Une voie transversale qui leur est exclusivement reserv&eacute;e traverse l&#39;ensemble d&#39;Est en Ouest, permettant d&#39;atteindre sans risque les quartiers environnants en passant sous la grande art&egrave;re nord-sud de circulation automobile.</p>

<p><u>Particular attention has been paid to the study of traffic, based on the total separation of cars and pedestrians. The roadways below lead to an underground car park with 79 spaces, the layout of which is facilitated by the natural slope of the land (3 metres difference in height). This garage is covered by a roof garden, providing an extra space for relaxation and children&rsquo;s games. A network of walkways for pedestrians is provided at ground level and also at other levels, sometimes lower and sometimes elevated. One walkway &ndash; exclusively reserved for pedestrians &ndash; runs through the whole development from east to west allowing them risk-free access to the surrounding areas, passing under the great north-south artery for road traffic.</u></p>

<p>La r&eacute;alisation aura lieu en deux &eacute;tapes: la premi&egrave;re tranche porte sur l&#39;immeuble de vingt-sept &eacute;tages (146 appartements) et le premier b&acirc;timent bas &agrave; deux niveaux (12), ainsi que sur le groupe de magasins de premi&egrave;re urgence avec logements au-dessus.</p>

<p><u>The construction will take place in two stages: The first being the twenty-seven floor building (146 flats) and the first low set building on two levels (12), as well as the most important shops with accommodation above.</u></p>

<p>L&#39;immeuble de 27 &eacute;tages est caracteris&eacute; par sa liaison tous les trois niveaux &agrave; la tour des circulations verticales. La disposition adopt&eacute;e a pour avantage premier de lib&eacute;rer les appartements de tout le bruit des installations m&eacute;caniques (mouvements d&#39;ascenseur);&nbsp;d&#39;autre part, il est obtenu plus de surface utile pour les appartements notamment dans les niveaux interm&eacute;diaires aux niveaux des coursives. Les appartements b&eacute;n&eacute;ficent d&#39;une double orientation. A l&#39;extremit&eacute; oppos&eacute;e aux passerelles d&#39;acc&egrave;s aux circulations verticales, ont &eacute;t&eacute; plac&eacute;s des appartements plus vastes, en angle.</p>

<p><u>The distinguishing feature of the 27 storey building is the link bridge every third floor to a service tower. The layout adopted has the advantage, firstly, of freeing the flats of any noise from the mechanical installations (lift movements); secondly, it results in more useable space for the flats, especially at the intermediate levels at the levels of the walkways. The flats benefit from a double aspect view. At the end opposite the access paths to the service tower, more spacious apartments have been provided.</u></p>

<p>On notera l&#39;exigence impos&eacute;e par les services de s&eacute;curit&eacute; de placer un escalier de secours en prolongement de la coursive. La plupart des appartements sont en duplex, accessibles au niveau moyen et se d&eacute;veloppent au niveau sup&eacute;rieur ou inf&eacute;rieur &agrave; la coursive.</p>

<p><u>One should note the requirement laid down by the security services to provide a fire escape to the walkway. The majority of flats are duplex, accessible at the middle level and situated on the level above or below the walkway.</u></p>

        </div>
      </div>

    <!-- Comments -->

    <!-- External Comments -->


    <!-- Q & A -->


  </div>
</div>


<script>
  (function(i,s,o,g,r,a,m){i['GoogleAnalyticsObject']=r;i[r]=i[r]||function(){
  (i[r].q=i[r].q||[]).push(arguments)},i[r].l=1*new Date();a=s.createElement(o),
  m=s.getElementsByTagName(o)[0];a.async=1;a.src=g;m.parentNode.insertBefore(a,m)
  })(window,document,'script','//www.google-analytics.com/analytics.js','ga');

  ga('create', 'UA-260281-29', 'auto');
  ga('send', 'pageview');

</script>
</body>
</html>
